app/controllers/blog_posts_controller.rb

INSERT INTO "blog_posts" ("author", "title", "blog_entry", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "rawr"], ["title", "rawr"], ["blog_entry", "rawr"], ["created_at", 2017-03-21 14:53:40 UTC], ["updated_at", 2017-03-21 14:53:40 UTC]]
---
	  def create
	  	@blog_post = BlogPost.new(blog_post_params) #we will build blog_post_params_later.
	  	respond_to do |format|
	  		if @blog_post.save